--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\rmb242\Documents\Econ388DataAssignment3-main\dataassignmen
> t3.log
  log type:  text
 opened on:  15 Apr 2023, 16:24:01

. import excel "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\ZIP_COUNTY
> _122020.xlsx", sheet("ZIP_COUNTY_122020") firstrow
(6 vars, 54,194 obs)

. order COUNTY

. rename COUNTY county

. rename ZIP zip

. drop RES_RATIO

. drop BUS_RATIO

. drop OTH_RATIO

. drop TOT_RATIO

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dt
> a"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
    saved

. clear

. import excel "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\HPI_AT_3zi
> p.xlsx", sheet("HPI_AT_3zip") cellrange(A5:G98789) firstrow
(7 vars, 98,784 obs)

. clear

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
> "

. clear

. import excel "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\HPI_AT_3zi
> p.xlsx", sheet("HPI_AT_3zip") cellrange(A5:G98789) firstrow allstring
(7 vars, 98,784 obs)

. drop F

. drop G

. drop IndexType

. rename ThreeDigitZIPCode zip

. rename Year year

. rename Quarter quarter

. rename IndexNSA housing_price_index

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data
> .dta"
file
    C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data.d
    > ta saved

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
> ", clear

. tab zip
too many values
r(134);

. sum zip

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         zip |          0

. gen 3dig_zip = substr(zip, 1,3)
3dig_zip invalid name
r(198);

. gen three_dig_zip = substr(zip,1,3)

. drop zip

. rename three_dig_zip zip

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dt
> a"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
    already exists
r(602);

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dt
> a"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
    saved

. destring zip, replace force
zip: all characters numeric; replaced as int

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dt
> a"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
    saved

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data.
> dta", clear

. destring zip, replace force
zip: all characters numeric; replaced as int

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data
> .dta"
file
    C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data.d
    > ta saved

. merge m:1 zip using "county_zip_data.dta"
file county_zip_data.dta not found
r(601);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the using data
r(459);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta", duplicates(keepfirst)
option duplicates() not allowed
r(198);

. duplicates report

Duplicates in terms of all variables

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |        98784             0
--------------------------------------

. duplicates zip report
zip invalid duplicates subcommand
r(198);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the using data
r(459);

. merge 1:m zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the master data
r(459);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the using data
r(459);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta", duplicates(keep)
option duplicates() not allowed
r(198);

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
> ", clear

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data.
> dta", clear

. merge 1:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta", duplicates(keepfirst)
option duplicates() not allowed
r(198);

. merge 1:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the master data
r(459);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the using data
r(459);

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
> ", clear

. order zip

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dt
> a"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
    saved

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data.
> dta", clear

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"
variable zip does not uniquely identify observations in the using data
r(459);

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta", duplicates(keepfirst)
option duplicates() not allowed
r(198);

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
> ", clear

. duplicates drop zip, force

Duplicates in terms of zip

(53,283 observations deleted)

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dt
> a"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_zip_data.dta
    saved

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\housing_price_data.
> dta", clear

. merge m:1 zip using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\cou
> nty_zip_data.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                            29
        from master                         0  (_merge==1)
        from using                         29  (_merge==2)

    Matched                            98,784  (_merge==3)
    -----------------------------------------

. order county

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_housing_pri
> ce_data.dta"
file
    C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_housing_price
    > _data.dta saved

. drop _merge

. clear

. import delimited using "DECENNIALPL2020.P1-2023-04-08T210433.csv"
file DECENNIALPL2020.P1-2023-04-08T210433.csv not found
r(601);

. import delimited using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\DECENNIALPL202
> 0.P1-2023-04-08T210433.csv"
(encoding automatically selected: UTF-8)
(3,222 vars, 71 obs)

. clear

. import excel "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\all-geocodes-v2021.xlsx"
> , sheet("all-geocodes-v2019") cellrange(A5:K43838) firstrow allstring
(11 vars, 43,833 obs)

. drop CountySubdivisionCodeFIPS

. drop PlaceCodeFIPS

. drop ConsolidtatedCityCodeFIPS

. gen state = "state"

. drop H

. 
. drop I

. 
. drop J

. 
. drop K

. replace state = "Alabama" if StateCodeFIPS = "01"
type mismatch
r(109);

. replace state = "Alabama" if StateCodeFIPS = 01
type mismatch
r(109);

. drop state

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\countyfipscodes.dta"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\countyfipscodes.dta saved

. clear

. import excel "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\co-est2022-pop.xlsx", sh
> eet("CO-EST2022-POP") cellrange(A3:E3154) firstrow allstring
(5 vars, 3,151 obs)

. rename PopulationEstimateasofJuly year2020

. drop D

. drop E

. drop April12020EstimatesBase

. drop in 1/2
(2 observations deleted)

. replace GeographicArea = substr(GeographicArea, 2, strpos(GeographicArea, ","))
(3,149 real changes made)

. replace GeographicArea = substr(GeographicArea, 2, strpos(GeographicArea, ",")-1)
(3,147 real changes made)

. undo
command undo is unrecognized
r(199);

. clear

. import excel "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\co-est2022-pop.xlsx", sh
> eet("CO-EST2022-POP") cellrange(A3:E3154) firstrow allstring
(5 vars, 3,151 obs)

. rename PopulationEstimateasofJuly year2020

. drop D

. drop E

. drop April12020EstimatesBase

. drop in 1/2
(2 observations deleted)

. replace GeographicArea = substr(GeographicArea, 2, strpos(GeographicArea, ","))
(3,149 real changes made)

. replace GeographicArea = substr(GeographicArea, 1, strpos(GeographicArea, ",")-1)
(3,147 real changes made)

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_population.dta"
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_population.dta saved

. rename GeographicArea countyname

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_population.dta", replace
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_population.dta saved

. clear

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\countyfipscodes.dta"

. rename AreaNameincludinglegalstati countyname

. gen countyfipscode = StateCodeFIPS + CountyCodeFIPS

. order countyfipscode

. order countyname

. save "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\countyfipscodes.dta", replace
file C:\Users\rmb242\Documents\Econ388DataAssignment3-main\countyfipscodes.dta saved

. clear

. use "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\county_population.dta"

. merge 1:1 countyname using "C:\Users\rmb242\Documents\Econ388DataAssignment3-main\countyfips
> codes.dta"
variable countyname does not uniquely identify observations in the master data
r(459);

. log close
      name:  <unnamed>
       log:  C:\Users\rmb242\Documents\Econ388DataAssignment3-main\dataassignment3.log
  log type:  text
 closed on:  15 Apr 2023, 18:38:56
----------------------------------------------------------------------------------------------
